app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    # @post = Post.new(
    #   title: params[:post][:title],
    #   author: params[:post][:author],
    #   text: params[:post][:text]
    # )
    if @post.save
---
INSERT INTO "posts" ("author", "created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "sad clg fan"], ["created_at", Tue, 21 Jul 2015 00:44:17 UTC +00:00], ["text", "CLG potential and faith"], ["title", "CLG"], ["updated_at", Tue, 21 Jul 2015 00:44:17 UTC +00:00]]